app/controllers/images_controller.rb

  def get_by_property
    @images = Image.where("property_id = ?",params[:id])
---
SELECT "images".* FROM "images" WHERE (property_id = '18')