app/controllers/interests_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "3"]]
SELECT "properties".* FROM "properties"
SELECT COUNT(*) FROM "interests" WHERE (user_id = '3' and property_id = 1)
INSERT INTO "interests" ("created_at", "property_id", "updated_at", "user_id") VALUES (?, ?, ?, ?)  [["created_at", Mon, 12 Dec 2011 15:53:07 UTC +00:00], ["property_id", 1], ["updated_at", Mon, 12 Dec 2011 15:53:07 UTC +00:00], ["user_id", 3]]
---
 def reset_interests

	@user = User.find(params[:user_id])
	@properties = Property.all

	  @properties.each do |u|

		@interest = Interest.where("user_id = ? and property_id = ?",params[:user_id],u.id)
		if @interest.empty?

			@interest = Interest.new(:user_id=>@user.id, :property_id=>u.id)
			@interest.save

SELECT "interests".* FROM "interests" WHERE (user_id = '3' and property_id= '18') LIMIT 1
DELETE FROM "interests" WHERE "interests"."id" = ?  [["id", 4]]
---
  def remove_interest
    @interest = Interest.where("user_id = ? and property_id= ?",params[:user_id],params[:property_id])
    @interest.first.destroy

SELECT "interests".* FROM "interests" WHERE "interests"."id" = ? LIMIT 1  [["id", "get_interest_id"]]
---
  def show
    @interest = Interest.find(params[:id])