app/controllers/notification_restrictions_controller.rb

  def get_by_user
    @notification_restriction = NotificationRestriction.where("user_id = ?",params[:id])
	if @notification_restriction.empty?
---
SELECT "notification_restrictions".* FROM "notification_restrictions" WHERE (user_id = '4') LIMIT 1
SELECT COUNT(*) FROM "notification_restrictions" WHERE (user_id = '4')

  def update
    @notification_restriction = NotificationRestriction.find(params[:id])

    respond_to do |format|
      if @notification_restriction.update_attributes(params[:notification_restriction])
---
SELECT "notification_restrictions".* FROM "notification_restrictions" WHERE "notification_restrictions"."id" = ? LIMIT 1  [["id", "2"]]
UPDATE "notification_restrictions" SET "minimumPrice" = 1000.0, "maximumPrice" = 300000.0, "updated_at" = '2011-12-13 15:50:45.319723' WHERE "notification_restrictions"."id" = 2