app/controllers/properties_controller.rb

SELECT properties.*,image.url as url FROM "interests" INNER JOIN "properties" ON "properties"."id" = "interests"."property_id" WHERE (user_id = '1')
---
  def get_interested

    @properties = Interest.joins(:property).where("user_id = ?",params[:user_id]).select("properties.*");

SELECT "properties".* FROM "properties" WHERE "properties"."id" = ? LIMIT 1  [["id", "get_interested"]]
---
  def show
    @property = Property.find(params[:id])

INSERT INTO "properties" ("address", "city", "country", "created_at", "description", "price", "property_type", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
SELECT "users".* FROM "users"
SELECT "notification_restrictions".* FROM "notification_restrictions" WHERE (user_id = 3) LIMIT 1
SELECT COUNT(*) FROM "notification_restrictions" WHERE (user_id = 1)
---
  def create
    @property = Property.new(params[:property])

    respond_to do |format|
      if @property.save

	  #notify users

		@users = User.all

	  @users.each do |u|

	  #c2dm = C2DM.new("org.feup.cmov.app@gmail.com", "feupcmov01", "PropsFinder")
	  #notification = { :registration_id => u.registration_id, :data => { :message => "Ola" }, :collapse_key => "biteme" }
	  #c2dm.send_notification(notification)

		options = {
		  :registration_id => u.registration_id,
		  :message => @property.id,
		  :extra_data => nil,
		  :collapse_key => "some-collapse-key"
		}

		@restrictionPassed = true
		#check if it matches the users price restrictions
		@restriction = NotificationRestriction.where("user_id = ?",u.id)

		if not @restriction.empty?

INSERT INTO "interests" ("created_at", "property_id", "updated_at", "user_id") VALUES (?, ?, ?, ?)  [["created_at", Sat, 10 Dec 2011 17:18:14 UTC +00:00], ["property_id", 18], ["updated_at", Sat, 10 Dec 2011 17:18:14 UTC +00:00], ["user_id", 1]]
---

		if @restrictionPassed == true
			@interest = Interest.new(:user_id => u.id, :property_id => @property.id)
			@interest.save

SELECT "properties".* FROM "properties" WHERE "properties"."id" = ? LIMIT 1  [["id", "3"]]
DELETE FROM "properties" WHERE "properties"."id" = ?  [["id", 3]]
---
  def destroy
    @property = Property.find(params[:id])
    @property.destroy