app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "4"]]
UPDATE "users" SET "registration_id" = 'APA91bHvF-zTAhfepHon-sDRhxgQ3j4b8op5wlVcfP3kTdM3yCpu8nxYSz6cci1nKlPM2cQ72vwbTMMNepq_IVFqDrTRXwpjYv5RBNYXo7VQwLKm2p0JdZOqkALVSi2Al2oKU2-vKLgnSpw7SxrDZtoqn0M4avcGTw', "updated_at" = '2011-12-11 17:18:32.978291' WHERE "users"."id" = 4
---
	def update_registration_id
		@user = User.find(params[:user_id])
		@user.registration_id = params[:registration_id]
		@user.save

SELECT "users".* FROM "users" WHERE (username = 'miguel' AND password = 'miguel') LIMIT 1
SELECT COUNT(*) FROM "users" WHERE (username = 'miguel' AND password = 'miguel')
---
	def sign_in
	@user = User.where("username = ? AND password = ?",params[:username], params[:password])

	if @user.empty?

INSERT INTO "users" ("created_at", "name", "password", "registration_id", "updated_at", "username") VALUES (?, ?, ?, ?, ?, ?)
---
  def create
    @user = User.new(params[:user])

    respond_to do |format|
      if @user.save